Revit 2027 API
IFCHybridImportOptions.Create Method
 Create a IFCHybridImportOptions from an options string, or null if it isn't hybrid mode.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCHybridImportOptions Create(
	string optionString
)
Public Shared Function Create (
	optionString As String
) As IFCHybridImportOptions
public:
static IFCHybridImportOptions^ Create(
	String^ optionString
)
static member Create :
        optionString : string -> IFCHybridImportOptions
Parameters
optionString String
 The options string.
Return Value
IFCHybridImportOptions
 The IFCHybridImportOptions, or null.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCHybridImportOptions Class
Autodesk.Revit.DB.IFC Namespace